<?php 
//Exerise 1

$i = 0;
while ($i <= 100){
    $i++;
    if ($i % 3 == 0){
        echo $i.", ";
    }
}
echo "<br>";

//Exercise 2

$i = 0;
do {
    if ($i == 0){
        $str = " - ноль.";
    } elseif ($i % 2 == 1) {
        $str = " - Нечетное число";
    } else {
        $str = " - Четное число";
    }
    echo $i.$str."<br>";
    $i=$i+1;
} while ($i <= 10);

//Exercise 3

$russia = [
    'Московская  область' => ['Москва', 'Зеленоград', 'Клин'],
    'Ленинградская  область'=>['Санкт-Петербург','Выброг','Павловск'],
    'Астраханская област'=>['Астрахань', 'Ахтубинск','Черный Яр','Нижний Баскунчак'],
    'Калужская область'=>['Балабаново','Жуков','Калуга','Козельск'],
    'Краснодарский край'=>['Адлер','Анапа','Красная поляна','Сочи']
];

foreach ($russia as $region => $cities) {
    echo "<br>".$region.":<br>";
    foreach ($cities as $city) {
        if ($city == $cities[count($cities)-1]) {
            echo $city.". ";
        } else {
            echo $city.", ";
        }
    }
}
echo  "<br>";
//Execise 4

$converter =[
    'а' => 'a',   'б' => 'b',   'в' => 'v',
    'г' => 'g',   'д' => 'd',   'е' => 'e',
    'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
    'и' => 'i',   'й' => 'y',   'к' => 'k',
    'л' => 'l',   'м' => 'm',   'н' => 'n',
    'о' => 'o',   'п' => 'p',   'р' => 'r',
    'с' => 's',   'т' => 't',   'у' => 'u',
    'ф' => 'f',   'х' => 'h',   'ц' => 'c',
    'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
    'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
    'э' => 'e',   'ю' => 'yu',  'я' => 'ya',

    'А' => 'A',   'Б' => 'B',   'В' => 'V',
    'Г' => 'G',   'Д' => 'D',   'Е' => 'E',
    'Ё' => 'E',   'Ж' => 'Zh',  'З' => 'Z',
    'И' => 'I',   'Й' => 'Y',   'К' => 'K',
    'Л' => 'L',   'М' => 'M',   'Н' => 'N',
    'О' => 'O',   'П' => 'P',   'Р' => 'R',
    'С' => 'S',   'Т' => 'T',   'У' => 'U',
    'Ф' => 'F',   'Х' => 'H',   'Ц' => 'C',
    'Ч' => 'Ch',  'Ш' => 'Sh',  'Щ' => 'Sch',
    'Ь' => '\'',  'Ы' => 'Y',   'Ъ' => '\'',
    'Э' => 'E',   'Ю' => 'Yu',  'Я' => 'Ya',
];

$str = 'Когда человек сознательно или интуитивно выбирает себе в жизни какую-то цель, жизненную задачу, он невольно дает себе оценку. По тому, ради чего человек живет, можно судить и о его самооценке - низкой или высокой.';

echo strtr($str, $converter);

//Exercise 5 (Можно просто добавить в предыдущий массив и тогда программа будет менять и буквы и пробелы)

$space = [' ' => '_'];
$str = 'Когда человек сознательно или интуитивно выбирает себе в жизни какую-то цель, жизненную задачу, он невольно дает себе оценку. По тому, ради чего человек живет, можно судить и о его самооценке - низкой или высокой.';
echo strtr($str, $space);
echo "<br>";

//Exercise 7

for ($i=0; $i < 10; print($i++." ")) { 
   
};
echo "<br>";

//Exercise 8

foreach ($russia as $region => $cities) {
    echo "<br>".$region.":<br>";
    foreach ($cities as $city) {
        $str = mb_substr($city, 0,1 );
        if ($str == "К") {
            echo $city.". ";
        }
    }
}
echo  "<br>";
//Exercise 9

$converter =[
    ' ' => '_',
    'а' => 'a',   'б' => 'b',   'в' => 'v',
    'г' => 'g',   'д' => 'd',   'е' => 'e',
    'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
    'и' => 'i',   'й' => 'y',   'к' => 'k',
    'л' => 'l',   'м' => 'm',   'н' => 'n',
    'о' => 'o',   'п' => 'p',   'р' => 'r',
    'с' => 's',   'т' => 't',   'у' => 'u',
    'ф' => 'f',   'х' => 'h',   'ц' => 'c',
    'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
    'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
    'э' => 'e',   'ю' => 'yu',  'я' => 'ya',

    'А' => 'A',   'Б' => 'B',   'В' => 'V',
    'Г' => 'G',   'Д' => 'D',   'Е' => 'E',
    'Ё' => 'E',   'Ж' => 'Zh',  'З' => 'Z',
    'И' => 'I',   'Й' => 'Y',   'К' => 'K',
    'Л' => 'L',   'М' => 'M',   'Н' => 'N',
    'О' => 'O',   'П' => 'P',   'Р' => 'R',
    'С' => 'S',   'Т' => 'T',   'У' => 'U',
    'Ф' => 'F',   'Х' => 'H',   'Ц' => 'C',
    'Ч' => 'Ch',  'Ш' => 'Sh',  'Щ' => 'Sch',
    'Ь' => '\'',  'Ы' => 'Y',   'Ъ' => '\'',
    'Э' => 'E',   'Ю' => 'Yu',  'Я' => 'Ya',
];
$str = 'Когда человек сознательно или интуитивно выбирает себе в жизни какую-то цель, жизненную задачу, он невольно дает себе оценку. По тому, ради чего человек живет, можно судить и о его самооценке - низкой или высокой.';

echo strtr($str, $converter);







?>